# 3. The Basics

In [1]:
import pandas as pd

In [2]:
PATH_DATA = '../mydata/'

## Get data

In [3]:
df_csv = pd.read_csv(PATH_DATA+'omh_data.csv')

In [4]:
df_csv.head()
# df_csv.head(10)

         Date   MSFT    AAPL
0  2014-12-01  48.62  115.07
1  2014-12-02  48.46  114.63
2  2014-12-03  48.08  115.93
3  2014-12-04  48.84  115.49
4  2014-12-05  48.42  115.00

In [5]:
df_csv.tail()
# df_csv.tail(10)

          Date   MSFT    AAPL
17  2014-12-24  48.14  112.01
18  2014-12-26  47.88  113.99
19  2014-12-29  47.45  113.91
20  2014-12-30  47.02  112.52
21  2014-12-31  46.45  110.38

In [6]:
df_csv.shape

(22, 3)

## Basics in Series

### Selecting 1

In [7]:
series1 = df_csv['MSFT']

In [8]:
series1[3]

48.84

In [9]:
series1[:3]

0    48.62
1    48.46
2    48.08
Name: MSFT, dtype: float64

In [10]:
series1[18:]

18    47.88
19    47.45
20    47.02
21    46.45
Name: MSFT, dtype: float64

In [11]:
series1[3:10]

3    48.84
4    48.42
5    47.70
6    47.59
7    46.90
8    47.17
9    46.95
Name: MSFT, dtype: float64

In [12]:
series1[3:10:2]

3    48.84
5    47.70
7    46.90
9    46.95
Name: MSFT, dtype: float64

### Selecting 2

In [13]:
series2 = series1.copy()

new_index = ['T'+str(i+2) for i in range(len(series2))]
series2.index = new_index ## --> reindexing the series

In [14]:
series2

T2     48.62
T3     48.46
T4     48.08
T5     48.84
T6     48.42
T7     47.70
T8     47.59
T9     46.90
T10    47.17
T11    46.95
T12    46.67
T13    45.16
T14    45.74
T15    47.52
T16    47.66
T17    47.98
T18    48.45
T19    48.14
T20    47.88
T21    47.45
T22    47.02
T23    46.45
Name: MSFT, dtype: float64

In [15]:
# series2.iloc[3]
series2[3]

48.84

In [16]:
# series2.loc['T5']
series2['T5']

48.84

### Selecting 3 - Boolean

In [17]:
series2

T2     48.62
T3     48.46
T4     48.08
T5     48.84
T6     48.42
T7     47.70
T8     47.59
T9     46.90
T10    47.17
T11    46.95
T12    46.67
T13    45.16
T14    45.74
T15    47.52
T16    47.66
T17    47.98
T18    48.45
T19    48.14
T20    47.88
T21    47.45
T22    47.02
T23    46.45
Name: MSFT, dtype: float64

In [18]:
series2<46

T2     False
T3     False
T4     False
T5     False
T6     False
T7     False
T8     False
T9     False
T10    False
T11    False
T12    False
T13     True
T14     True
T15    False
T16    False
T17    False
T18    False
T19    False
T20    False
T21    False
T22    False
T23    False
Name: MSFT, dtype: bool

In [19]:
series2[series2<46]

T13    45.16
T14    45.74
Name: MSFT, dtype: float64

In [20]:
series2[(series2>46)&(series2<48)]

T7     47.70
T8     47.59
T9     46.90
T10    47.17
T11    46.95
T12    46.67
T15    47.52
T16    47.66
T17    47.98
T20    47.88
T21    47.45
T22    47.02
T23    46.45
Name: MSFT, dtype: float64

In [21]:
## all of series less than 47?
(series2<47).all()

False

In [22]:
## any of series less than 47?
(series2<46).any()

True

### Get values and Sorting

In [23]:
series2.index

Index(['T2', 'T3', 'T4', 'T5', 'T6', 'T7', 'T8', 'T9', 'T10', 'T11', 'T12',
       'T13', 'T14', 'T15', 'T16', 'T17', 'T18', 'T19', 'T20', 'T21', 'T22',
       'T23'],
      dtype='object')

In [24]:
series2.values

array([48.62, 48.46, 48.08, 48.84, 48.42, 47.7 , 47.59, 46.9 , 47.17,
       46.95, 46.67, 45.16, 45.74, 47.52, 47.66, 47.98, 48.45, 48.14,
       47.88, 47.45, 47.02, 46.45])

In [25]:
series2.sort_values()

T13    45.16
T14    45.74
T23    46.45
T12    46.67
T9     46.90
T11    46.95
T22    47.02
T10    47.17
T21    47.45
T15    47.52
T8     47.59
T16    47.66
T7     47.70
T20    47.88
T17    47.98
T4     48.08
T19    48.14
T6     48.42
T18    48.45
T3     48.46
T2     48.62
T5     48.84
Name: MSFT, dtype: float64

### Get Description

In [26]:
series2.sum()

1044.8500000000001

In [27]:
series2.mean()

47.493181818181824

In [28]:
series2.std()

0.9330767659106357

In [29]:
series2.median()

47.625

In [30]:
series2.quantile(0.5) ## --> P50

47.625

In [31]:
series2.quantile(0.75) ## --> P75

48.125

In [32]:
series2.quantile(0.99) ## --> P99

48.793800000000005

In [33]:
series2.max()

48.84

In [34]:
series2.min()

45.16

In [35]:
series2.cumsum()

T2       48.62
T3       97.08
T4      145.16
T5      194.00
T6      242.42
T7      290.12
T8      337.71
T9      384.61
T10     431.78
T11     478.73
T12     525.40
T13     570.56
T14     616.30
T15     663.82
T16     711.48
T17     759.46
T18     807.91
T19     856.05
T20     903.93
T21     951.38
T22     998.40
T23    1044.85
Name: MSFT, dtype: float64

### Modify Series

In [36]:
series2

T2     48.62
T3     48.46
T4     48.08
T5     48.84
T6     48.42
T7     47.70
T8     47.59
T9     46.90
T10    47.17
T11    46.95
T12    46.67
T13    45.16
T14    45.74
T15    47.52
T16    47.66
T17    47.98
T18    48.45
T19    48.14
T20    47.88
T21    47.45
T22    47.02
T23    46.45
Name: MSFT, dtype: float64

In [37]:
series2['T10'] = 49

In [38]:
series2

T2     48.62
T3     48.46
T4     48.08
T5     48.84
T6     48.42
T7     47.70
T8     47.59
T9     46.90
T10    49.00
T11    46.95
T12    46.67
T13    45.16
T14    45.74
T15    47.52
T16    47.66
T17    47.98
T18    48.45
T19    48.14
T20    47.88
T21    47.45
T22    47.02
T23    46.45
Name: MSFT, dtype: float64

### Operational Series

Index must Align

In [39]:
series3 = series2.copy()

In [40]:
# series3 / 10
# series3 + 10
# series3 - 10
# series3 * 10

series3 = series3 / 10

In [41]:
series4 = series2 + series3
series4

T2     53.482
T3     53.306
T4     52.888
T5     53.724
T6     53.262
T7     52.470
T8     52.349
T9     51.590
T10    53.900
T11    51.645
T12    51.337
T13    49.676
T14    50.314
T15    52.272
T16    52.426
T17    52.778
T18    53.295
T19    52.954
T20    52.668
T21    52.195
T22    51.722
T23    51.095
Name: MSFT, dtype: float64

In [42]:
series5 = series2 - series3
series5

T2     43.758
T3     43.614
T4     43.272
T5     43.956
T6     43.578
T7     42.930
T8     42.831
T9     42.210
T10    44.100
T11    42.255
T12    42.003
T13    40.644
T14    41.166
T15    42.768
T16    42.894
T17    43.182
T18    43.605
T19    43.326
T20    43.092
T21    42.705
T22    42.318
T23    41.805
Name: MSFT, dtype: float64

In [43]:
## Let say create a DataFrame from those Series
data_row = pd.DataFrame([series4,
              series3,
              series5], index = ['Lbound','Mbound','Ubound'])

data_column = pd.DataFrame({'Lbound': series4,
                            'Mbound': series3,
                            'Ubound': series5})

In [44]:
data_row

,T2,T3,T4,T5,T6,T7,T8,T9,T10,T11,...,T14,T15,T16,T17,T18,T19,T20,T21,T22,T23
Lbound,53.482,53.306,52.888,53.724,53.262,52.47,52.349,51.59,53.9,51.645,...,50.314,52.272,52.426,52.778,53.295,52.954,52.668,52.195,51.722,51.095
Mbound,4.862,4.846,4.808,4.884,4.842,4.77,4.759,4.69,4.9,4.695,...,4.574,4.752,4.766,4.798,4.845,4.814,4.788,4.745,4.702,4.645
Ubound,43.758,43.614,43.272,43.956,43.578,42.93,42.831,42.21,44.1,42.255,...,41.166,42.768,42.894,43.182,43.605,43.326,43.092,42.705,42.318,41.805

In [45]:
data_column

     Lbound  Mbound  Ubound
T2   53.482   4.862  43.758
T3   53.306   4.846  43.614
T4   52.888   4.808  43.272
T5   53.724   4.884  43.956
T6   53.262   4.842  43.578
T7   52.470   4.770  42.930
T8   52.349   4.759  42.831
T9   51.590   4.690  42.210
T10  53.900   4.900  44.100
T11  51.645   4.695  42.255
T12  51.337   4.667  42.003
T13  49.676   4.516  40.644
T14  50.314   4.574  41.166
T15  52.272   4.752  42.768
T16  52.426   4.766  42.894
T17  52.778   4.798  43.182
T18  53.295   4.845  43.605
T19  52.954   4.814  43.326
T20  52.668   4.788  43.092
T21  52.195   4.745  42.705
T22  51.722   4.702  42.318
T23  51.095   4.645  41.805

## Selecting in DataFrame

### Columns

Get one column of pandas

In [46]:
df_csv['MSFT'] ## --> Series

## Therefore, column behavior almost same as series

0     48.62
1     48.46
2     48.08
3     48.84
4     48.42
5     47.70
6     47.59
7     46.90
8     47.17
9     46.95
10    46.67
11    45.16
12    45.74
13    47.52
14    47.66
15    47.98
16    48.45
17    48.14
18    47.88
19    47.45
20    47.02
21    46.45
Name: MSFT, dtype: float64

In [47]:
df_csv[['MSFT']] ## --> DataFrame

     MSFT
0   48.62
1   48.46
2   48.08
3   48.84
4   48.42
5   47.70
6   47.59
7   46.90
8   47.17
9   46.95
10  46.67
11  45.16
12  45.74
13  47.52
14  47.66
15  47.98
16  48.45
17  48.14
18  47.88
19  47.45
20  47.02
21  46.45

In [48]:
df_csv[['MSFT','AAPL']] ## --> DataFrame

     MSFT    AAPL
0   48.62  115.07
1   48.46  114.63
2   48.08  115.93
3   48.84  115.49
4   48.42  115.00
5   47.70  112.40
6   47.59  114.12
7   46.90  111.95
8   47.17  111.62
9   46.95  109.73
10  46.67  108.23
11  45.16  106.75
12  45.74  109.41
13  47.52  112.65
14  47.66  111.78
15  47.98  112.94
16  48.45  112.54
17  48.14  112.01
18  47.88  113.99
19  47.45  113.91
20  47.02  112.52
21  46.45  110.38

In [49]:
## get index
df_csv[['MSFT']].index
# df_csv[['MSFT']].index.tolist()

RangeIndex(start=0, stop=22, step=1)

### rows

In [50]:
df_csv.iloc[10:15] ## -->DataFrame

          Date   MSFT    AAPL
10  2014-12-15  46.67  108.23
11  2014-12-16  45.16  106.75
12  2014-12-17  45.74  109.41
13  2014-12-18  47.52  112.65
14  2014-12-19  47.66  111.78

In [51]:
df_csv.iloc[9] ## -->series

Date    2014-12-12
MSFT         46.95
AAPL        109.73
Name: 9, dtype: object

In [52]:
df_csv.iloc[9].index

Index(['Date', 'MSFT', 'AAPL'], dtype='object')

### Selecting DataFrame - Boolean

In [53]:
df_csv[df_csv['MSFT']<47]

          Date   MSFT    AAPL
7   2014-12-10  46.90  111.95
9   2014-12-12  46.95  109.73
10  2014-12-15  46.67  108.23
11  2014-12-16  45.16  106.75
12  2014-12-17  45.74  109.41
21  2014-12-31  46.45  110.38

In [54]:
df_csv[df_csv['MSFT']==46.45]

          Date   MSFT    AAPL
21  2014-12-31  46.45  110.38

In [55]:
df_csv[(df_csv['MSFT']<48)&(df_csv['AAPL']>111)]

          Date   MSFT    AAPL
5   2014-12-08  47.70  112.40
6   2014-12-09  47.59  114.12
7   2014-12-10  46.90  111.95
8   2014-12-11  47.17  111.62
13  2014-12-18  47.52  112.65
14  2014-12-19  47.66  111.78
15  2014-12-22  47.98  112.94
18  2014-12-26  47.88  113.99
19  2014-12-29  47.45  113.91
20  2014-12-30  47.02  112.52

### Get Specific Range

In [56]:
df_csv

          Date   MSFT    AAPL
0   2014-12-01  48.62  115.07
1   2014-12-02  48.46  114.63
2   2014-12-03  48.08  115.93
3   2014-12-04  48.84  115.49
4   2014-12-05  48.42  115.00
5   2014-12-08  47.70  112.40
6   2014-12-09  47.59  114.12
7   2014-12-10  46.90  111.95
8   2014-12-11  47.17  111.62
9   2014-12-12  46.95  109.73
10  2014-12-15  46.67  108.23
11  2014-12-16  45.16  106.75
12  2014-12-17  45.74  109.41
13  2014-12-18  47.52  112.65
14  2014-12-19  47.66  111.78
15  2014-12-22  47.98  112.94
16  2014-12-23  48.45  112.54
17  2014-12-24  48.14  112.01
18  2014-12-26  47.88  113.99
19  2014-12-29  47.45  113.91
20  2014-12-30  47.02  112.52
21  2014-12-31  46.45  110.38

In [57]:
df_csv.at[5,'MSFT']

47.7

In [58]:
df_csv.at[5,'AAPL']

112.4

In [59]:
df_csv[['MSFT','AAPL']][5:10]

    MSFT    AAPL
5  47.70  112.40
6  47.59  114.12
7  46.90  111.95
8  47.17  111.62
9  46.95  109.73

## DataFrame Summary

In [60]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 3 columns):
Date    22 non-null object
MSFT    22 non-null float64
AAPL    22 non-null float64
dtypes: float64(2), object(1)
memory usage: 608.0+ bytes

In [61]:
df_csv2 = pd.read_csv(PATH_DATA +'omh_data.csv',parse_dates=['Date'])

In [62]:
df_csv2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 3 columns):
Date    22 non-null datetime64[ns]
MSFT    22 non-null float64
AAPL    22 non-null float64
dtypes: datetime64[ns](1), float64(2)
memory usage: 608.0 bytes

In [63]:
df_csv.describe()

            MSFT        AAPL
count  22.000000   22.000000
mean   47.493182  112.411364
std     0.933077    2.388772
min    45.160000  106.750000
25%    46.967500  111.660000
50%    47.625000  112.530000
75%    48.125000  114.087500
max    48.840000  115.930000

In [64]:
df_csv['Date'].describe()

count             22
unique            22
top       2014-12-24
freq               1
Name: Date, dtype: object